//// Pobiera ostatnie zdarzenia sieciowe urządzeń 
DeviceNetworkEvents
|  search "paste_data_from_user_here" 
| project DeviceName,
| order by test



////  Filtruje zdarzenia dla konkretnego adresu IP
DeviceNetworkEvents
| search "paste_data_from_user_here" 
| where IPAddress == "192.168.1.1"
| project DeviceName, IPAddress, TimeGenerated


////  Filtruje 2
DeviceNetworkEvents
| search "paste_data_from_user_here" 
| project DeviceName3


////
DeviceNetworkEvents
| search "paste_data_from_user_here" 
| project DeviceName5





//////Detect process drops via Azure Custom Script Extension performing lateral movement
let process_drop_via_arc = (
    DeviceFileEvents
    | where TimeGenerated > ago(7d)
    | search ""
    // Search for file created events by Arc Custom Script Handler
    | where ActionType == "FileCreated"
    | where InitiatingProcessFileName =~ "customscripthandler.exe"
    | where isnotempty(SHA256)
    | distinct SHA256
);
DeviceNetworkEvents
| search ""
| where TimeGenerated > ago(1h)
| join kind=inner process_drop_via_arc on $left.InitiatingProcessSHA256 == $right.SHA256
| where RemotePort in ("5985", "5986", "445", "3389", "22", "5900", "135")
| where ActionType in~ ("ConnectionSuccess", "ConnectionAttempt", 
"ConnectionFailed", "ConnectionRequest")
