//// Pobiera ostatnie zdarzenia sieciowe urządzeń 
DeviceNetworkEvents
|  search "paste_data_from_user_here" 
| project DeviceName,
| order by test



////  Filtruje zdarzenia dla konkretnego adresu IP
DeviceNetworkEvents
| search "paste_data_from_user_here" 
| where IPAddress == "192.168.1.1"
| project DeviceName, IPAddress, TimeGenerated


////  Filtruje 2
DeviceNetworkEvents
| search "paste_data_from_user_here" 
| project DeviceName3


////
DeviceNetworkEvents
| search "paste_data_from_user_here" 
| project DeviceName5
